#!/bin/bash

#----------------------------------------------------------
# 本スクリプトは、単体では使用せずに
# auto_install_start.shと合わせてご利用ください。
#----------------------------------------------------------

#----------------------------------------------------------
# 直前のコマンドの実行結果の判定関数
#----------------------------------------------------------
function check_command_status () {
  if [ "$?" -ne 0 ]; then
    echo "$1"
    exit 1
  fi
}

#----------------------------------------------------------
# 現在時間を出力する関数
#----------------------------------------------------------
function print_current_time () {
  echo `date '+%y/%m/%d %H:%M:%S'`
}

#----------------------------------------------------------
# dnfコマンドでのパッケージの変更をする関数
#----------------------------------------------------------
function change_dnf_package () {
  COMMAND_PREFIX=''
  if [ "$3" != "" ]; then
    COMMAND_PREFIX='sudo '
  fi
  ${COMMAND_PREFIX}rm -rf /var/cache/dnf/*
  ${COMMAND_PREFIX}dnf clean all
  ${COMMAND_PREFIX}dnf -y $1 $2
}
